{
  "persona": "Emily, The Cautious Gift-Giver",
  "name": "Emily Rodriguez",
  "age": 29,
  "profession": "Social Media Manager",
  "income": 65000,
  "education": "Bachelor's in Communications",
  "location": "Austin, Texas",
  "background": "Emily is a social media manager. She is on a website for a specific, high-stakes purpose: completing an important task for someone she cares about. She rarely does this type of activity and is not a regular user of this site. She has done some research but is now in the high-anxiety completion phase. In her spare time, she's a competitive puzzle solver who has learned to methodically check every detail before committing to a solution - this translates directly to her approach of double-checking every step of any important process.",
  "core_motivation": "To make the 'perfect' choice and avoid disappointment. She wants to feel confident that she's made the right decision and that the process is secure.",
  "primary_anxiety": "Perfectionist's Remorse. Her biggest fear is messing up the task—making the wrong choice, having it go to the wrong place, or missing a key detail. She is also anxious about spending a significant amount of money or time on a site she's not an expert on.",
  "decision_making_style": "Trust-Seeker. She will actively scan the page for trust signals: security seals, clear policies, and professional-looking buttons.",
  "technical_proficiency": "Novice User. She is comfortable with basic web interactions but not an expert on this specific site's processes.",
  "interaction_pattern": "She is a 'verifier.' She will likely re-read the summary multiple times to confirm the details before acting.",
  "work_habits": "She is detail-oriented and methodical, preferring to double-check everything before committing to an action.",
  "device_context": "She primarily uses her laptop, preferring the larger screen for reading details and comparing options.",
  "accessibility_needs": "None",
  "dominant_trait": "Cautious and Trust-Seeking. Emily approaches the task with careful attention to detail and a need for reassurance.",
  "failure_conditions": {
    "abandonment_by_uncertainty": "She will terminate if the process feels unclear or if she can't verify the details. Her reasoning would be, 'I need to be absolutely sure about this before I commit.'",
    "abandonment_by_distrust": "She will terminate if the site doesn't provide clear trust signals or if the process feels unprofessional. Her reasoning would be, 'This doesn't feel secure enough for such an important task.'",
    "abandonment_by_complexity": "She will terminate if the process becomes too complex or requires information she doesn't have readily available."
  },
  "archetype": "cautious_gift_giver",
  "user_type": "novice_user",
  "core_value": "Perfection and Security. Emily believes that any process worth doing is worth doing perfectly, and she will only trust platforms that provide clear verification and security measures.",
  "emotional_trigger": "Her primary emotional trigger for abandoning a product is a feeling of Uncertainty, which she interprets as the software not providing enough reassurance for her to feel confident in her decision."
}
