{
    "persona": "Persona: Ava\n\nBackground:\nAva is a driven nonprofit executive who has dedicated her career to empowering marginalized communities and advocating for social change. Despite the challenges of working in the nonprofit sector, she remains unwavering in her commitment to making a meaningful impact on the lives of those she serves.\n\nDemographics:\nAge: 41\nGender: Female\nEducation: Master's Degree in Nonprofit Management\nProfession: Nonprofit Executive Director\nIncome: $52,000\n\nFinancial Situation:\nAs the executive director of a thriving nonprofit organization, Ava's income falls within the $30,001 to $94,000 range. While she is not wealthy, she has learned to manage her finances prudently, prioritizing the needs of her organization and its beneficiaries over personal luxuries. Ava is skilled at securing grants and donations to support the programs and initiatives her nonprofit offers.\n\nShopping Habits:\nAva's shopping habits reflect her practical and purpose-driven approach to life. She is selective in her purchases, focusing on high-quality, long-lasting items that align with her personal and professional values. Ava frequents ethical and sustainable brands, as well as secondhand and consignment stores, to find unique and meaningful pieces for her wardrobe and home.\n\nProfessional Life:\nIn her role as the executive director, Ava is a skilled communicator, strategic thinker, and passionate advocate. She works tirelessly to secure funding, build partnerships, and oversee the day-to-day operations of her organization, all while maintaining a deep connection to the communities it serves. Ava's leadership style is inclusive and collaborative, empowering her team to contribute to the organization's mission in meaningful ways.\n\nPersonal Style:\nAva's personal style reflects her professional persona – polished, yet practical. She favors well-tailored yet comfortable clothing that allows her to move effortlessly between meetings, events, and field work. Ava's wardrobe is a mix of timeless classics and statement pieces that showcase her individual style and commitment to ethical fashion.",
    "intent": "add amika dry shampoo to my cart",
    "age": 41,
    "age_group": "35-44",
    "gender": "female",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}