{
    "persona": "Persona: Sarah\n\nBackground:\nSarah is a driven and passionate marketing professional who has found her calling in the world of sustainable fashion. With a keen eye for design and a commitment to ethical consumerism, she has carved out a niche for herself in the industry, helping to promote eco-friendly brands and raise awareness about the environmental impact of the fashion industry.\n\nDemographics:\nAge: 34\nGender: Female\nEducation: Bachelor's Degree in Marketing\nProfession: Marketing Manager, Sustainable Fashion Brand\nIncome: $56,000\n\nFinancial Situation:\nSarah's income as a marketing manager for a sustainable fashion brand falls within the $30,001 to $94,000 range. She is mindful of her spending and strives to maintain a balanced financial portfolio, allocating funds towards savings, investments, and occasional splurges on sustainable fashion pieces that align with her values.\n\nShopping Habits:\nShopping is more than just a routine activity for Sarah; it is a means of expressing her personal values and supporting the causes she believes in. She dedicated to seeking out ethical, environmentally-conscious brands and often researches the supply chain and manufacturing practices of the products she purchases. Sarah also enjoys thrifting and upcycling to reduce waste and give new life to pre-loved items.\n\nProfessional Life:\nAs the marketing manager for a sustainable fashion brand, Sarah is responsible for developing and executing campaigns that showcase the brand's commitment to sustainability and ethical practices. She collaborates closely with the design team to ensure that the brand's messaging and visual identity resonate with environmentally-conscious consumers. Sarah's creativity, strategic thinking, and passion for sustainability have been invaluable in driving the brand's growth and increasing its impact within the industry.\n\nPersonal Style:\nSarah's personal style is a reflection of her values and her passion for sustainable fashion. She gravitates towards timeless, versatile pieces made from organic, recycled, or ethically-sourced materials. Her wardrobe includes a mix of modern silhouettes, such as tailored blazers and wide-leg pants, as well as more casual, bohemian-inspired items like flowy dresses and vintage-inspired blouses. Sarah accessorizes with sustainable jewelry, recycled leather bags, and eco-friendly footwear, completing her look with a touch of effortless elegance.\n\nIn her free time, Sarah enjoys exploring local thrift stores and sustainable boutiques, seeking out unique finds that she can incorporate into her wardrobe. She also actively participates in beach cleanups, fashion swaps, and other community initiatives that align with her commitment to environmental conservation and ethical consumerism.",
    "intent": "buy a sustainable, eco-friendly ski onesie in size medium.",
    "age": 34,
    "age_group": "25-34",
    "gender": "female",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}