{
    "persona": "Persona: Sarah\n\nBackground:\nSarah is a successful real estate investor and property developer. She has built a thriving business by identifying and capitalizing on lucrative real estate opportunities in growing urban markets. Sarah is driven, innovative, and constantly seeking new ways to expand her portfolio and create value for her clients.\n\nDemographics:\nAge: 33\nGender: Female\nEducation: Bachelor's Degree in Business Administration\nProfession: Real Estate Investor, Property Developer\nIncome: $175,000\n\nFinancial Situation:\nSarah's real estate investments and development projects have made her a high-income earner. She is financially savvy and reinvests a significant portion of her earnings back into her business to fuel its continued growth. While she maintains a comfortable lifestyle, Sarah is disciplined about her spending and focused on building long-term wealth.\n\nShopping Habits:\nSarah's shopping habits reflect her professional success and entrepreneurial mindset. She enjoys browsing for high-quality, durable items that can withstand the demands of her fast-paced lifestyle. Whether it's a luxury handbag, a tailored suit, or the latest smart home technology, Sarah seeks out products that combine fashion, function, and value.\n\nProfessional Life:\nAs a real estate investor and developer, Sarah's days are filled with a diverse array of tasks, from property acquisitions and market analysis to construction management and client negotiations. She thrives in this dynamic, ever-changing environment and is skilled at juggling multiple priorities. Sarah's keen eye for detail, strategic thinking, and problem-solving abilities have been instrumental to her success.\n\nPersonal Style:\nSarah's personal style is polished, sophisticated, and practical. She favors well-tailored, professional attire that conveys a sense of authority and competence. At the same time, Sarah is not afraid to experiment with bold, fashion-forward pieces that reflect her personal flair. She believes that her appearance should complement her confidence and business acumen.",
    "intent": "buy a PKE meter from Ghostbusters",
    "age": 33,
    "age_group": "25-34",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}