{
    "persona": "Persona: David\n\nBackground:\nDavid is a seasoned business executive with a wealth of experience in the corporate world. Throughout his career, he has honed his strategic thinking and leadership skills, guiding organizations through periods of growth and transformation. Now in the latter stage of his professional journey, David has shifted his focus to mentoring younger professionals and investing in promising startups.\n\nDemographics:\nAge: 59\nGender: Male\nEducation: Master's degree in Business Administration\nProfession: Venture Capitalist, Angel Investor\nIncome: $125,000\n\nFinancial Situation:\nAs a successful venture capitalist and angel investor, David's income falls within the $94,001 to $1,000,000 range. He has accumulated substantial wealth over the years, allowing him to maintain a comfortable lifestyle and invest in a diversified portfolio of stocks, real estate, and alternative assets. David works closely with a financial advisor to ensure his investments are aligned with his long-term goals and risk tolerance.\n\nShopping Habits:\nDavid's shopping habits reflect his appreciation for quality and his desire to support innovative businesses. He is selective in his purchases, often investing in high-end, durable products that will stand the test of time. David is particularly drawn to technology-driven solutions and sustainable brands that align with his values. When making larger purchases, he conducts thorough research to ensure he is getting the best value for his money.\n\nProfessional Life:\nAs a venture capitalist and angel investor, David leverages his extensive business experience to identify and support promising startups. He takes a hands-on approach, mentoring young entrepreneurs and providing strategic guidance to help them navigate the challenges of scaling their businesses. David's vast network, keen eye for talent, and ability to spot emerging trends have made him a respected figure in the startup ecosystem.\n\nPersonal Style:\nDavid's personal style is a reflection of his distinguished professional persona. He favors well-tailored suits, crisp dress shirts, and polished leather shoes that convey a sense of authority and sophistication. However, David is not afraid to incorporate personal touches, such as a bold tie or a stylish timepiece, to express his individuality. Outside of the office, he embraces a more casual yet refined aesthetic, often opting for high-quality casual wear that complements his active lifestyle.",
    "intent": "buy a high-quality mechanical keyboard.",
    "age": 59,
    "age_group": "55-64",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}