{
    "persona": "Persona: Robert\n\nBackground:\nRobert is a resilient and determined individual who has faced numerous challenges throughout his life. Despite having limited financial resources, he takes pride in his ability to find creative solutions to support himself and his family.\n\nDemographics:\nAge: 51\nGender: Male\nEducation: High School Diploma\nProfession: Handyman/Odd Jobs\nIncome: $25,000\n\nFinancial Situation:\nAs a self-employed handyman and odd-job worker, Robert's income fluctuates, often falling within the low-to-moderate range. He carefully manages his limited budget, prioritizing essential expenses like rent, utilities, and basic necessities. Robert is adept at finding ways to stretch his resources, whether through bartering, scouring local thrift stores, or taking on additional work opportunities.\n\nShopping Habits:\nRobert is a practical and resourceful shopper. He often frequents garage sales, flea markets, and secondhand stores in search of gently used, affordable items that can be repaired or repurposed. When necessary, he will make strategic purchases at big-box retailers, but always with an eye for quality and value. Robert takes pride in his ability to find creative solutions to meet his needs without overspending.\n\nProfessional Life:\nRobert's professional life is characterized by his versatility and adaptability. As a handyman, he takes on a wide range of odd jobs, from minor home repairs to yard work and landscaping. His extensive experience and problem-solving skills allow him to tackle various tasks, often using his ingenuity to find cost-effective solutions. Robert takes pride in his work and the satisfaction he derives from helping others maintain their homes and properties.\n\nPersonal Style:\nRobert's personal style reflects his practical and hardworking nature. He typically wears durable, comfortable clothing that can withstand the demands of his physical work, such as well-worn jeans, sturdy boots, and moisture-wicking t-shirts. While his wardrobe may not be the latest fashion, Robert takes care to ensure his clothes are neat, clean, and functional.\n\nIn his free time, Robert enjoys pursuing hobbies that allow him to use his hands, such as woodworking and gardening. He finds solace in these activities, which not only provide him with a creative outlet but also help him save money by producing his own goods and produce.",
    "intent": "buy a ocean cat lure 9\" fishing lure.",
    "age": 51,
    "age_group": "45-54",
    "gender": "male",
    "income": [
        0,
        30000
    ],
    "income_group": "0-30000"
}