{
    "persona": "Persona: Avery\n\nBackground:\nAvery is a driven and ambitious college student, pursuing a degree in computer science with a minor in entrepreneurship. She has a keen interest in technology and a passion for solving complex problems, driven by her vision to one day launch her own innovative startup.\n\nDemographics:\nAge: 20\nGender: Female\nEducation: Sophomore, Computer Science Major with Entrepreneurship Minor\nProfession: Student\nIncome: $100,000 (through a combination of academic scholarships, family support, and a part-time software engineering internship)\n\nFinancial Situation:\nAvery's financial situation is relatively stable, thanks to the combination of academic scholarships, family support, and her part-time internship income. She is financially responsible, carefully budgeting her resources to cover tuition, living expenses, and occasional tech-related purchases. Avery is also actively saving a portion of her earnings to fund her entrepreneurial aspirations in the future.\n\nShopping Habits:\nAs a tech-savvy and socially conscious consumer, Avery is selective in her shopping habits. She researches products extensively, seeking out high-quality, innovative, and environmentally-friendly options. Avery frequents online marketplaces, tech forums, and specialty stores to discover the latest gadgets, software tools, and sustainable apparel that align with her personal values and aesthetic preferences.\n\nProfessional Life:\nAvery's academic and extracurricular activities reflect her passion for technology and entrepreneurship. She is actively involved in her university's computer science club, coding competitions, and startup accelerator program, where she collaborates with her peers on innovative projects and pitches. Avery's exceptional academic performance and her proven ability to apply her technical skills to real-world challenges have earned her prestigious internship opportunities at leading technology companies.\n\nPersonal Style:\nAvery's personal style is a blend of functionality, comfort, and a touch of personal flair. She favors modern, minimalist silhouettes, often in neutral tones or bold, vibrant hues. Her wardrobe consists of high-quality, versatile pieces that can easily transition from her academic pursuits to her extracurricular activities. Avery also enjoys experimenting with the latest sustainable fashion trends and accessorizing with tech-inspired jewelry and gadgets.\n\nIn her free time, Avery can be found immersed in the latest tech news, attending coding workshops, or exploring the entrepreneurial ecosystem in her city. She is driven, curious, and always seeking to expand her knowledge and skills to achieve her ambitious goals.",
    "intent": "add women's black compression stockings to cart",
    "age": 20,
    "age_group": "18-24",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}