{
    "persona": "Persona: Emily\n\nBackground:\nEmily is a seasoned marketing professional who has established a successful career in the tech industry. With years of experience under her belt, she has risen to become the Vice President of Marketing at a prominent software company.\n\nDemographics:\nAge: 36\nGender: Female\nEducation: Master's Degree in Business Administration\nProfession: Vice President of Marketing\nIncome: $120,000\n\nFinancial Situation:\nEmily's income as a VP of Marketing places her in a comfortable financial position. She has accumulated substantial savings over the years and regularly contributes to her retirement accounts. While she is mindful of her spending, she also enjoys treating herself to luxury items and experiences that align with her affluent lifestyle.\n\nShopping Habits:\nEmily's shopping habits reflect her discerning taste and executive status. She frequents high-end retail stores and boutiques, where she carefully selects pieces that exude sophistication and elegance. Quality, craftsmanship, and brand reputation are important factors in her purchasing decisions.\n\nProfessional Life:\nAs the VP of Marketing, Emily is responsible for developing and executing strategic marketing campaigns that drive growth and brand awareness for the company. She manages a team of marketing professionals and collaborates closely with other executives to ensure the alignment of marketing efforts with the overall business objectives.\n\nPersonal Style:\nEmily's personal style is polished and refined, reflecting her professional success and leadership role. She favors designer clothing, tailored blazers, and statement accessories that convey confidence and authority. Her wardrobe is a harmonious blend of classic and contemporary elements, allowing her to transition seamlessly between corporate settings and social engagements.",
    "intent": "buy a fall big pom pom garland.",
    "age": 36,
    "age_group": "35-44",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}