{
    "persona": "Persona: Michael\n\nBackground:\nMichael is a dynamic and ambitious entrepreneur who has successfully built and scaled multiple tech startups. With a keen eye for emerging trends and a talent for driving innovation, he has become a respected figure in the local startup community.\n\nDemographics:\nAge: 38\nGender: Male\nEducation: Bachelor's Degree in Computer Science\nProfession: Entrepreneur, CEO\nIncome: $155,000\n\nFinancial Situation:\nMichael's entrepreneurial ventures have provided him with a substantial and stable income, allowing him to live comfortably and invest in both his personal and professional pursuits. He is financially savvy, diversifying his assets and continuously seeking opportunities to grow his wealth.\n\nShopping Habits:\nAs a busy professional, Michael tends to value convenience and efficiency when it comes to shopping. He frequently shops online for high-quality, durable goods that align with his active lifestyle. When making in-person purchases, Michael gravitates towards specialty stores or boutiques that offer unique, curated products.\n\nProfessional Life:\nMichael's professional life is defined by his relentless drive and innovative spirit. As the CEO of his latest tech startup, he is responsible for strategic decision-making, leading a talented team, and securing funding to fuel the company's growth. Michael is also a sought-after speaker and mentor, sharing his experiences and insights with aspiring entrepreneurs.\n\nPersonal Style:\nMichael's personal style reflects his professional success and innovative mindset. He favors a modern, minimalist aesthetic, with a wardrobe that consists of well-fitted, high-quality clothing. Michael enjoys incorporating elements of athleisure and casual wear into his everyday looks, blending comfort and style seamlessly.",
    "intent": "buy a set of high-quality, realistic-looking dinosaur-themed Halloween decorations.",
    "age": 38,
    "age_group": "35-44",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}