{
    "persona": "Persona: Evelyn\n\nBackground:\nEvelyn is a trailblazing executive who has spent the past three decades carving out an impressive career in the male-dominated world of finance. As the CEO of a successful investment firm, she has earned a reputation for her strategic acumen, unwavering integrity, and dedication to mentoring the next generation of financial leaders.\n\nDemographics:\nAge: 61\nGender: Female\nEducation: Master's Degree in Finance\nProfession: CEO, Investment Firm\nIncome: $380,000\n\nFinancial Situation:\nEvelyn's decades of hard work and savvy financial decisions have resulted in substantial wealth. She maintains a comfortable lifestyle, with the financial freedom to indulge in her passions and support causes she cares about. Evelyn is a disciplined investor, constantly seeking opportunities to grow her assets while ensuring a balanced, diversified portfolio.\n\nShopping Habits:\nAs a seasoned professional, Evelyn values quality and functionality in her purchases. She gravitates towards timeless, well-crafted items that will stand the test of time, whether it's a classic designer handbag or a tailored power suit. Evelyn is not afraid to splurge on luxury items that bring her joy, but she also appreciates the convenience and efficiency of online shopping.\n\nProfessional Life:\nEvelyn's unwavering commitment to excellence has propelled her to the top of the financial industry. As the CEO of her firm, she oversees a team of investment analysts and portfolio managers, guiding them with her extensive knowledge and keen strategic vision. Evelyn's leadership has been instrumental in expanding the firm's global reach and diversifying its investment portfolio.\n\nPersonal Style:\nEvelyn's personal style reflects her professional persona – polished, sophisticated, and impeccably put together. She favors designer suits, tailored blouses, and statement accessories that convey a sense of authority and confidence. Evelyn's wardrobe is a curated collection of timeless pieces that she can mix and match to create effortless, elegant looks.\n\nIn her personal life, Evelyn enjoys indulging in her love of art and literature, often attending gallery openings and author events. She is also an avid traveler, exploring new destinations and immersing herself in different cultures.",
    "intent": "buy a high-quality stainless steel food warmer burner.",
    "age": 61,
    "age_group": "55-64",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}