{
    "persona": "Persona: Emma\n\nBackground:\nEmma is a vibrant and ambitious college student, driven to make a positive impact on her community. She is studying environmental science and is passionate about sustainability and eco-friendly initiatives.\n\nDemographics:\nAge: 19\nGender: Female\nEducation: Sophomore in college, majoring in Environmental Science\nProfession: Student\nIncome: $35,000 (through a combination of scholarships, part-time work, and parental support)\n\nFinancial Situation:\nAs a college student, Emma's financial situation is modest but stable. She has secured several scholarships and financial aid, which, combined with her part-time job, allows her to cover her tuition and living expenses. Emma is mindful of her spending and practices budgeting to ensure she can maintain a comfortable lifestyle while saving for her future.\n\nShopping Habits:\nEmma's shopping habits reflect her environmental consciousness and desire to support sustainable brands. She researches products extensively, prioritizing items made from eco-friendly materials and produced by companies with ethical practices. While she enjoys the occasional splurge on high-quality, durable items, Emma is generally more inclined to seek out secondhand or thrifted options to minimize her environmental footprint.\n\nProfessional Life:\nIn addition to her studies, Emma is actively involved in several campus organizations focused on environmental advocacy and sustainability initiatives. She has taken on leadership roles, organizing events and campaigns to raise awareness and inspire positive change. Emma's dedication and innovative thinking have earned her the respect of her peers and the admiration of her professors.\n\nPersonal Style:\nEmma's personal style is a reflection of her values and her desire to live an intentional lifestyle. She favors comfortable, versatile clothing made from sustainable fabrics, often incorporating vintage or upcycled pieces into her wardrobe. Her aesthetic is a blend of bohemian and minimalist, with a focus on natural textures and earth-toned palettes. Emma accessorizes with handmade jewelry and statement pieces that showcase her individuality.\n\nIn her free time, Emma can be found volunteering at the campus garden, attending lectures on environmental topics, or exploring the local farmers' market in search of organic produce and artisanal goods. She is an avid reader and enjoys sharing her knowledge with others, inspiring them to adopt more eco-friendly practices.",
    "intent": "buy a gender-neutral, organic cotton baby boy romper.",
    "age": 19,
    "age_group": "18-24",
    "gender": "female",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}