{
    "persona": "Persona: Sara\n\nBackground:\nSara is a passionate educator who has dedicated her career to empowering students and advocating for educational equity. As a middle school teacher, she has developed innovative teaching methods that inspire her students to reach their full potential.\n\nDemographics:\nAge: 35\nGender: Female\nEducation: Master's degree in Education\nProfession: Middle School Teacher\nIncome: $55,000\n\nFinancial Situation:\nWith a stable income as a middle school teacher, Sara maintains a comfortable financial standing. She is able to cover her essential expenses, save for the future, and occasionally indulge in her personal interests. Sara works closely with a financial advisor to ensure her money is managed responsibly and aligned with her long-term goals.\n\nShopping Habits:\nSara approaches shopping with a balance of practicality and mindfulness. She is selective in her purchases, often seeking out high-quality, durable items that will last. At the same time, Sara enjoys discovering unique, locally-sourced products that align with her values of sustainability and community support.\n\nProfessional Life:\nAs a middle school teacher, Sara's professional life is centered around nurturing the growth and development of her students. She is passionate about creating engaging lesson plans, fostering a inclusive and supportive classroom environment, and advocating for resources and policies that enhance educational opportunities for all. Sara's dedication and innovative teaching methods have earned her the respect of her colleagues and the admiration of her students.\n\nPersonal Style:\nSara's personal style reflects her active lifestyle and her commitment to comfort and functionality. She favors versatile, well-made clothing that can seamlessly transition from the classroom to outdoor activities. Her wardrobe includes a mix of classic pieces and more casual, sporty items that allow her to move freely and express her authentic self.",
    "intent": "buy a milwaukee m12 jigsaw.",
    "age": 35,
    "age_group": "35-44",
    "gender": "female",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}