{
    "persona": "Persona: Nolan\n\nBackground:\nNolan is a seasoned executive who has navigated the corporate world with exceptional skill and acumen. His strategic mindset and visionary leadership have enabled him to rise to the top of his industry, where he now holds a senior-level position at a prestigious multinational company.\n\nDemographics:\nAge: 39\nGender: Male\nEducation: Master's Degree in Business Administration\nProfession: Vice President of Operations\nIncome: $250,000\n\nFinancial Situation:\nNolan's substantial income allows him to maintain a comfortable and secure financial standing. He has built a diverse investment portfolio, which includes real estate, stocks, and various other financial instruments. While he enjoys the benefits of his success, Nolan remains grounded and fiscally responsible, focusing on long-term wealth preservation and philanthropic endeavors.\n\nShopping Habits:\nNolan's shopping habits reflect his pragmatic and discerning nature. He gravitates towards high-quality, durable products that not only serve their intended purpose but also embody a sense of timeless elegance. Whether it's selecting a new suit for an important business meeting or upgrading his home electronics, Nolan approaches each purchase with a keen eye for value and functionality.\n\nProfessional Life:\nAs the Vice President of Operations, Nolan is responsible for overseeing the efficient and strategic execution of his company's day-to-day operations. He takes pride in fostering a collaborative work environment, where his team members are empowered to contribute their expertise and innovative ideas. Nolan is adept at navigating complex challenges, making data-driven decisions, and ensuring the organization remains agile and competitive.\n\nPersonal Style:\nNolan's personal style exudes a refined and professional demeanor. He favors well-tailored suits, crisp dress shirts, and polished leather shoes for his daily work attire. When not in a formal business setting, Nolan gravitates towards more casual yet still sophisticated pieces, such as button-down shirts, chinos, and high-quality knitwear. His wardrobe is curated to reflect his distinguished personal brand and the high standards he upholds in both his professional and personal life.",
    "intent": "add Anker Go power bank to cart",
    "age": 39,
    "age_group": "35-44",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}