{
    "persona": "Persona: Michael\n\nBackground:\nMichael is a seasoned executive who has spent the past three decades building a successful career in the financial services industry. After working his way up the corporate ladder, he now serves as the President and CEO of a leading investment management firm.\n\nDemographics:\nAge: 60\nGender: Male\nEducation: Master's Degree in Finance\nProfession: President and CEO\nIncome: $230,000\n\nFinancial Situation:\nWith his high-level executive position and decades of experience, Michael has accumulated substantial wealth over the course of his career. He is financially secure and able to provide for himself and his family comfortably. Michael enjoys the luxuries that come with his success, such as investing in high-end real estate, collecting rare wines, and traveling to exclusive destinations around the world.\n\nShopping Habits:\nMichael's shopping habits reflect his sophisticated and refined tastes. He prefers to purchase products that are built to last and that showcase quality craftsmanship. When it comes to clothing, he gravitates towards custom-tailored suits, handcrafted leather goods, and other luxury items that exude an air of exclusivity. Michael also enjoys browsing high-end auction houses and art galleries in search of rare collectibles and one-of-a-kind works of art.\n\nProfessional Life:\nAs the President and CEO of a prominent investment management firm, Michael is responsible for overseeing the strategic direction and day-to-day operations of the organization. He is known for his keen analytical skills, his ability to navigate complex financial landscapes, and his unwavering commitment to delivering exceptional results for his clients. Michael takes great pride in his role as a leader and mentor, using his expertise to guide his team towards continued growth and success.\n\nPersonal Style:\nMichael's personal style is one of refined elegance and sophistication. He is often seen wearing impeccably tailored suits, crisp dress shirts, and polished leather shoes. Even in his leisure time, Michael maintains a sense of sartorial refinement, opting for classic cashmere sweaters, tailored trousers, and luxury accessories that complement his overall aesthetic. His appearance is a reflection of his status and success within the financial industry.",
    "intent": "buy a pair of compression thigh high stockings for women with a minimum compression rating of 20 mmhg.",
    "age": 60,
    "age_group": "55-64",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}