{
    "persona": "Persona: Ethan\n\nBackground:\nEthan is a driven and ambitious 29-year-old entrepreneur who has built a thriving technology startup. With a keen eye for innovative solutions and a relentless work ethic, he has positioned his company at the forefront of its industry, attracting significant investment and earning him a comfortable income.\n\nDemographics:\nAge: 29\nGender: Male\nEducation: Bachelor's Degree in Computer Science\nProfession: Founder and CEO of a Technology Startup\nIncome: $350,000\n\nFinancial Situation:\nEthan's success as an entrepreneur has afforded him a high-income lifestyle. He is financially savvy, reinvesting a substantial portion of his earnings back into his business to fuel its growth. While he maintains a comfortable standard of living, Ethan is also mindful of his long-term financial goals, allocating resources towards investments and retirement planning.\n\nShopping Habits:\nEthan's shopping habits reflect his professional accomplishments and lifestyle. He tends to gravitate towards high-quality, technologically-advanced products that align with his interests and needs. Whether it's the latest smartphone, a sleek and powerful laptop, or a stylish yet functional wardrobe, Ethan is willing to invest in products that offer exceptional performance and durability.\n\nProfessional Life:\nEthan's drive and innovative spirit have been the driving forces behind his entrepreneurial success. He is constantly seeking new challenges and opportunities, always looking to stay ahead of the curve in his industry. His ability to identify market trends, develop cutting-edge solutions, and effectively lead his team have earned him a reputation as a visionary and respected business leader.\n\nPersonal Style:\nEthan's personal style reflects his professional persona – modern, refined, and focused on functionality. He favors well-tailored suits, crisp button-down shirts, and polished leather shoes when in a business setting. In his free time, he gravitates towards a more casual yet still stylish look, often opting for slim-fit jeans, designer t-shirts, and fashionable sneakers.\n\nLeisure Activities:\nDespite his demanding work schedule, Ethan makes a conscious effort to maintain a healthy work-life balance. He enjoys exploring the latest technological advancements, both for personal and professional purposes. Ethan is an avid reader, with a particular interest in business literature and entrepreneurial biographies. He also finds solace in outdoor activities, such as hiking and cycling, as a way to unwind and recharge.",
    "intent": "buy a mint cocoa flavored hot chocolate mix.",
    "age": 29,
    "age_group": "25-34",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}