{
    "persona": "Persona: Vivian\n\nBackground:\nVivian is a seasoned business leader who has spent the majority of her career navigating the corporate landscape. With over three decades of experience, she has risen through the ranks to become the President and CEO of a thriving technology company. Known for her strategic vision, innovative thinking, and unwavering commitment to excellence, Vivian has been instrumental in driving her organization's growth and success.\n\nDemographics:\nAge: 62\nGender: Female\nEducation: Master's Degree in Business Administration\nProfession: President and CEO of a Technology Company\nIncome: $235,000\n\nFinancial Situation:\nVivian's successful career as a top-level executive has afforded her a comfortable and financially secure lifestyle. She has amassed a substantial investment portfolio, including real estate, stocks, and bonds, which provides her with a steady stream of income and a robust retirement plan. Vivian is adept at managing her finances, ensuring that she maintains a balanced approach between personal expenditures and philanthropic endeavors.\n\nShopping Habits:\nVivian's shopping habits reflect her discerning taste and appreciation for quality. She prefers to invest in timeless, high-end products that exude sophistication and durability. Whether she is shopping for designer clothing, luxury accessories, or cutting-edge technology, Vivian conducts thorough research to ensure she is making informed purchases that align with her personal values and professional needs.\n\nProfessional Life:\nAs the President and CEO of a leading technology company, Vivian is responsible for setting the strategic direction of the organization, driving innovation, and fostering a culture of excellence. Her exceptional leadership skills, analytical acumen, and ability to navigate complex business challenges have been instrumental in propelling her company to new heights. Vivian is widely respected by her peers and is often sought out for her industry expertise and visionary approach.\n\nPersonal Style:\nVivian's personal style is a reflection of her confidence and professional stature. She favors timeless, elegantly tailored pieces that exude sophistication and command attention. Her wardrobe consists of designer suits, silk blouses, and statement-making accessories that complement her poised and polished demeanor. Vivian's sartorial choices often convey her appreciation for tradition while embracing modern sensibilities.\n\nIn her free time, Vivian indulges in her love for the arts, attending prestigious gallery openings and exclusive cultural events. She is also an ardent supporter of various philanthropic organizations, leveraging her influence and resources to drive positive change within her community and beyond.",
    "intent": "buy decorative light switch plates that are elegant and high-quality.",
    "age": 62,
    "age_group": "55-64",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}