{
    "persona": "Persona: Jacob\n\nBackground:\nJacob is a driven and versatile professional who has carved out a successful career as a small business consultant. With a diverse background in entrepreneurship and a passion for helping others achieve their goals, Jacob has become a trusted advisor to a growing portfolio of local businesses.\n\nDemographics:\nAge: 38\nGender: Male\nEducation: Bachelor's Degree in Business Administration\nProfession: Small Business Consultant\nIncome: $65,000\n\nFinancial Situation:\nJacob's steady income as a consultant allows him to live comfortably and save for the future. He is financially savvy, maintaining a diversified investment portfolio and mindfully allocating his resources to support his lifestyle and future goals.\n\nShopping Habits:\nJacob's shopping habits reflect his pragmatic approach to life. He seeks out high-quality, durable products that will withstand the demands of his busy lifestyle. While he is not opposed to splurging on occasion, Jacob generally prefers to invest in timeless pieces that will serve him well in the long run.\n\nProfessional Life:\nAs a small business consultant, Jacob leverages his extensive entrepreneurial experience to help his clients navigate the challenges of running a successful venture. He takes a hands-on approach, collaborating closely with business owners to develop customized strategies for growth and sustainability. Jacob's ability to think strategically and problem-solve has made him a valuable asset to the local business community.\n\nPersonal Style:\nJacob's personal style is a blend of professionalism and practicality. He gravitates towards well-tailored suits and dress shirts that convey a sense of authority and competence. At the same time, Jacob enjoys incorporating casual elements, such as crisp chinos and minimalist sneakers, to maintain a approachable and relatable demeanor.",
    "intent": "buy a breast cancer awareness ribbon necklace.",
    "age": 38,
    "age_group": "35-44",
    "gender": "male",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}