{
    "persona": "Persona: Jacob\n\nBackground:\nJacob is a passionate artist and activist who has dedicated his life to advocating for social justice and environmental causes. He uses his artistic talents to create thought-provoking works that challenge societal norms and inspire change.\n\nDemographics:\nAge: 46\nGender: Male\nEducation: High School Diploma\nProfession: Freelance Artist and Activist\nIncome: $20,000\n\nFinancial Situation:\nAs a freelance artist and activist, Jacob's income fluctuates, but he is committed to living a simple, sustainable lifestyle. He prioritizes his artistic and social impact work over financial gain, often taking on commission-based projects or participating in activist events that provide minimal compensation. Jacob is resourceful and finds creative ways to stretch his limited budget.\n\nShopping Habits:\nJacob's shopping habits reflect his focus on ethical, eco-friendly products and his desire to support local businesses and independent creators. He frequents thrift stores, secondhand shops, and artisanal markets in search of unique, one-of-a-kind items. Jacob is conscious of his environmental footprint and avoids fast fashion or mass-produced goods whenever possible.\n\nProfessional Life:\nJacob's days are a blend of creating his own art, participating in activist campaigns, and collaborating with like-minded individuals. He is actively involved in local grassroots organizations, lending his artistic skills to design posters, banners, and other visuals for protests and awareness-raising events. Jacob's dedication to using his craft for social and environmental change is the driving force behind his professional life.\n\nPersonal Style:\nJacob's personal style reflects his commitment to sustainability and social responsibility. He favors vintage, repurposed, or ethically-sourced clothing, often accessorizing with handmade jewelry or upcycled items. Jacob's fashion choices are a canvas for his political and environmental messages, with t-shirts or patches that convey his beliefs.\n\nJacob lives in a modest, co-op style housing community in a vibrant, culturally diverse neighborhood. He is an avid cyclist and enjoys exploring the nearby parks and urban gardens for inspiration.",
    "intent": "buy a gy6 150cc engine",
    "age": 46,
    "age_group": "45-54",
    "gender": "male",
    "income": [
        0,
        30000
    ],
    "income_group": "0-30000"
}