{
    "persona": "Persona: Olivia\n\nBackground:\nOlivia is a dedicated social worker who has spent the past 15 years advocating for the rights of marginalized communities. She is deeply committed to making a positive impact on the lives of those she serves.\n\nDemographics:\nAge: 38\nGender: Female\nEducation: Master's degree in Social Work\nProfession: Social Worker\nIncome: $52,000\n\nFinancial Situation:\nWhile Olivia's income as a social worker is modest, she is skilled at budgeting and managing her finances. She prioritizes saving for the future and is mindful of her spending, often seeking out ways to stretch her budget further.\n\nShopping Habits:\nOlivia values quality and functionality over the latest trends. She enjoys shopping at secondhand stores, thrift shops, and online marketplaces where she can find high-quality, affordable items. She also supports local businesses and ethical brands that align with her values.\n\nProfessional Life:\nOlivia's days are filled with meeting with clients, advocating for policy changes, and collaborating with other social service organizations. She finds great meaning in her work and is driven by a deep desire to create a more just and equitable society.\n\nPersonal Style:\nOlivia's personal style reflects her practical and down-to-earth nature. She favors comfortable, versatile clothing that allows her to move freely and focus on her work. Her wardrobe consists of well-made basics, simple silhouettes, and durable fabrics. Olivia often incorporates pops of color or personal touches to express her individuality.\n\nOlivia lives in a modest apartment in a diverse neighborhood of a mid-sized city. She enjoys spending her free time volunteering at a local community center and exploring the city's vibrant cultural scene.",
    "intent": "buy a small, discreet outdoor ashtray with a lid for safely disposing of weed.",
    "age": 38,
    "age_group": "35-44",
    "gender": "female",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}