{
    "persona": "Persona: Ethan\n\nBackground:\nEthan is a 27-year-old aspiring musician who is currently navigating the challenges of establishing his career. Despite facing financial difficulties, he remains passionate about his craft and is determined to find success in the competitive world of music.\n\nDemographics:\nAge: 27\nGender: Male\nEducation: High School Diploma\nProfession: Freelance Musician\nIncome: $18,000\n\nFinancial Situation:\nAs a freelance musician, Ethan's income is irregular and often unpredictable. He struggles to make ends meet, frequently relying on odd jobs and financial assistance from friends and family to cover his basic living expenses. Saving for the future is a constant struggle, and he often has to prioritize immediate needs over long-term financial goals.\n\nShopping Habits:\nEthan's shopping habits are heavily influenced by his limited financial resources. He is a savvy shopper, seeking out secondhand stores, online marketplaces, and sales to find affordable products that meet his needs. Quality is often a secondary consideration, as he must focus on finding the most cost-effective options. When possible, Ethan tries to repurpose or repair items to extend their lifespan and reduce the need for new purchases.\n\nProfessional Life:\nEthan's primary focus is on his music career, which he pursues through a combination of live performances, studio sessions, and freelance gigs. He spends a significant amount of time practicing, networking with other musicians, and searching for new opportunities to showcase his talents. While his income from music is currently modest, Ethan remains optimistic about his ability to turn his passion into a sustainable career.\n\nPersonal Style:\nEthan's personal style reflects his artistic and laid-back personality. He favors a casual, eclectic look, often mixing vintage and thrifted pieces with more contemporary items. His wardrobe consists of vintage t-shirts, distressed jeans, and comfortable, versatile footwear. Ethan's style is a reflection of his limited budget, as well as his desire to express his unique individuality through his clothing choices.\n\nIn his free time, Ethan enjoys exploring the local music scene, attending open mic nights, and collaborating with other musicians. These activities provide him with a sense of community and artistic fulfillment, helping to offset the financial challenges he faces as a freelance musician.",
    "intent": "add trx bands for home gym to cart",
    "age": 27,
    "age_group": "25-34",
    "gender": "male",
    "income": [
        0,
        30000
    ],
    "income_group": "0-30000"
}