{
    "persona": "Persona: Sophia\n\nBackground:\nSophia is a driven and ambitious marketing executive who has quickly risen through the ranks in the competitive world of digital advertising. With a keen eye for emerging trends and a knack for crafting impactful campaigns, she has become a valuable asset to her agency.\n\nDemographics:\nAge: 29\nGender: Female\nEducation: Master's Degree in Marketing\nProfession: Marketing Executive\nIncome: $120,000\n\nFinancial Situation:\nSophia's impressive income allows her to maintain a comfortable lifestyle in the city. She is financially savvy, regularly contributing to her retirement accounts and investment portfolio to secure her long-term financial goals.\n\nShopping Habits:\nSophia's shopping habits reflect her busy lifestyle and fashion-forward sensibilities. She enjoys browsing high-end retail stores and online boutiques for stylish, yet practical, wardrobe pieces. She is also a loyal customer of a few select luxury brands that she believes epitomize quality and craftsmanship.\n\nProfessional Life:\nAs a marketing executive, Sophia is responsible for leading teams of creatives and strategists to develop cutting-edge digital campaigns for a diverse range of clients. She thrives on the fast-paced, dynamic nature of her work and is constantly seeking new challenges to further her career.\n\nPersonal Style:\nSophia's personal style is a reflection of her professional success and confident personality. She favors sleek, tailored silhouettes in a neutral color palette, often accenting her looks with statement accessories and bold, yet sophisticated, makeup. Her style is both aspirational and approachable.\n\nSophia is an avid reader and enjoys attending industry events to network and stay informed about the latest marketing trends. She typically wakes up at 6 am each day to start her morning routine before heading to the office.\n\nSophia resides in New York City.",
    "intent": "buy a PKE meter inspired by the Ghostbusters movie.",
    "age": 29,
    "age_group": "25-34",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}