{
    "persona": "Persona: Michael\n\nBackground:\nMichael is a seasoned entrepreneur who has built a successful technology consulting firm over the past two decades. Known for his strategic vision and innovative problem-solving abilities, he has guided his company through periods of rapid growth and industry disruption.\n\nDemographics:\nAge: 42\nGender: Male\nEducation: Master's Degree in Business Administration\nProfession: Founder and CEO, Technology Consulting Firm\nIncome: $220,000\n\nFinancial Situation:\nAs the owner and CEO of a thriving consulting business, Michael enjoys a robust income that places him in the upper-middle to upper-class bracket. He has accumulated substantial wealth through his entrepreneurial endeavors, which he manages with the help of a team of financial advisors. Michael is prudent in his spending, prioritizing investments and long-term financial security.\n\nShopping Habits:\nMichael's shopping habits reflect his pragmatic and results-oriented approach to life. He tends to invest in high-quality, durable goods that will provide lasting value. When making purchases, he conducts thorough research, seeking out the best products and services to meet his needs. While he is willing to pay a premium for exceptional quality, Michael is also mindful of finding the right balance between cost and value.\n\nProfessional Life:\nAs the founder and CEO of a renowned technology consulting firm, Michael is a respected and influential figure in his industry. He takes pride in building a dynamic, innovative team that delivers cutting-edge solutions to a diverse clientele. Michael is actively involved in the day-to-day operations of the business, guiding strategic decision-making and fostering a culture of excellence.\n\nPersonal Style:\nMichael's personal style reflects his professional stature and successful entrepreneurial journey. He favors well-tailored, sophisticated attire, such as custom-fitted suits, crisp dress shirts, and polished leather shoes. However, he is also known to embrace a more casual, yet still polished, look when the occasion calls for it, opting for well-made casual wear that complements his overall sense of style.",
    "intent": "add self-adhesive marble-patterned cork tiles to shopping cart",
    "age": 42,
    "age_group": "35-44",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}