{
    "persona": "Persona: Ethan\n\nBackground:\nEthan is a driven and ambitious 21-year-old who has already made his mark in the fast-paced world of technology startups. With a keen eye for innovation and a natural talent for problem-solving, he has carved out a successful career as a software engineer, contributing to the development of cutting-edge digital solutions.\n\nDemographics:\nAge: 21\nGender: Male\nEducation: Bachelor's Degree in Computer Science\nProfession: Software Engineer at a Technology Startup\nIncome: $48,000\n\nFinancial Situation:\nAs a young professional in the tech industry, Ethan's income falls within the $30,001 to $94,000 range. He has a solid financial footing, allowing him to live comfortably while also saving a portion of his earnings for future goals, such as further education or potential entrepreneurial ventures.\n\nShopping Habits:\nEthan's shopping habits reflect his pragmatic yet forward-thinking approach to life. He invests in high-quality, durable items that serve both his professional and personal needs, such as sleek, minimalist tech accessories and versatile, stylish clothing. Ethan also enjoys exploring the latest trends in the tech world, often seeking out innovative products and gadgets that align with his interests and enhance his productivity.\n\nProfessional Life:\nIn his role as a software engineer, Ethan is responsible for designing, developing, and implementing innovative digital solutions that cater to the evolving needs of his company's clients. He thrives on the fast-paced, collaborative environment, collaborating with cross-functional teams to bring cutting-edge ideas to life. Ethan's passion for technology and problem-solving drive him to constantly stay up-to-date with the latest industry developments, allowing him to contribute valuable insights and stay at the forefront of his field.\n\nPersonal Style:\nEthan's personal style reflects his blend of professionalism and youthful energy. He favors a modern, streamlined look, often pairing well-fitted, minimalist clothing with sleek, tech-inspired accessories. Ethan's wardrobe is a mix of versatile, high-quality basics and occasional statement pieces that showcase his unique sense of style. He values comfort and functionality, but also understands the importance of presenting a polished, put-together appearance in both his personal and professional life.",
    "intent": "buy a amika hair mask.",
    "age": 21,
    "age_group": "18-24",
    "gender": "male",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}