{
    "persona": "Persona: Edward\n\nBackground:\nEdward is a seasoned entrepreneur who has built a successful career by leveraging his extensive business acumen and innovative thinking. After years of founding and guiding various startups, he has now transitioned into a more advisory role, sharing his wealth of knowledge with a new generation of budding entrepreneurs.\n\nDemographics:\nAge: 64\nGender: Male\nEducation: Master's Degree in Business Administration\nProfession: Entrepreneur, Angel Investor\nIncome: $180,000\n\nFinancial Situation:\nWith his successful entrepreneurial ventures and savvy investment strategies, Edward has amassed substantial wealth over the years. He is financially secure and enjoys a comfortable lifestyle, though he remains mindful of his spending and continues to seek out opportunities to grow his assets and create lasting value.\n\nShopping Habits:\nEdward's shopping habits reflect his pragmatic and forward-thinking approach to life. He prefers to invest in high-quality, durable products that will stand the test of time, whether it's a tailored suit for a business meeting or the latest technological gadget to streamline his work and personal activities. He also enjoys browsing antique shops and estate sales in search of unique collectibles that hold both sentimental and monetary value.\n\nProfessional Life:\nAs an experienced entrepreneur and angel investor, Edward takes great pride in his ability to identify promising business opportunities and provide guidance to aspiring founders. He enjoys mentoring young entrepreneurs, offering them not only financial support but also valuable insights and strategic advice gleaned from his own successes and failures. Edward's keen eye for innovation and his extensive network within the startup ecosystem make him a sought-after advisor in the business community.\n\nPersonal Style:\nEdward's personal style is a reflection of his distinguished professional persona. He favors well-crafted, classic menswear pieces that exude an air of sophistication and authority, such as expertly tailored suits, crisp dress shirts, and polished leather shoes. However, he is not afraid to occasionally incorporate a touch of contemporary flair, such as a bold patterned tie or a sleek, modern wristwatch, to keep his look fresh and dynamic.",
    "intent": "buy a harry potter luna wand.",
    "age": 64,
    "age_group": "55-64",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}