{
    "persona": "Persona: Olivia\n\nBackground:\nOlivia is a successful business owner who has built a thriving interior design firm over the past two decades. Known for her impeccable taste and ability to transform spaces, she has earned a reputation as one of the most sought-after designers in her city.\n\nDemographics:\nAge: 63\nGender: Female\nEducation: Bachelor's Degree in Interior Design\nProfession: Interior Design Business Owner\nIncome: $150,000\n\nFinancial Situation:\nOlivia's successful interior design business has placed her in a comfortable financial position. Her income falls within the $94,001 to $1,000,000 range, allowing her to enjoy a high standard of living while also investing in her personal interests and philanthropic endeavors.\n\nShopping Habits:\nAs a connoisseur of design, Olivia's shopping habits revolve around sourcing the finest materials, furnishings, and accessories for her projects and her own home. She frequents high-end design showrooms, antique stores, and exclusive online marketplaces, curating a collection of unique and timeless pieces.\n\nProfessional Life:\nOlivia's passion for interior design has been the driving force behind her entrepreneurial success. She oversees a team of talented designers, project managers, and support staff, ensuring that each client's vision is brought to life with meticulous attention to detail. Olivia's keen eye for aesthetics and ability to stay ahead of industry trends have made her firm a leading authority in the world of interior design.\n\nPersonal Style:\nOlivia's personal style reflects her refined and sophisticated taste. She gravitates towards luxurious fabrics, tailored silhouettes, and classic color palettes, often incorporating bold accents and statement accessories to add a touch of personalization. Her wardrobe is a carefully curated collection of high-quality designer pieces that complement her elegant and poised demeanor.\n\nIn her free time, Olivia enjoys indulging in her love for art, architecture, and travel. She is an avid collector of unique pieces and frequently attends gallery openings and design showcases to stay inspired and ahead of the curve.",
    "intent": "buy a high-quality facial stone gua sha tool.",
    "age": 63,
    "age_group": "55-64",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}