{
    "persona": "Persona: David\n\nBackground:\nDavid is a passionate and driven individual who has carved out a career in the non-profit sector. After completing his master's degree in social work, he found his calling in advocating for underserved communities and working to create positive social change.\n\nDemographics:\nAge: 32\nGender: Male\nEducation: Master's Degree in Social Work\nProfession: Program Manager at a Non-Profit Organization\nIncome: $52,000\n\nFinancial Situation:\nDavid's income as a program manager at a non-profit organization falls within the $30,001 to $94,000 range. While his salary is modest, he has developed a frugal lifestyle and is adept at budgeting his finances. He prioritizes saving and investing in causes he believes in, ensuring he maintains a comfortable standard of living.\n\nShopping Habits:\nDavid's shopping habits reflect his values and commitment to social responsibility. He prefers to support local businesses, ethical brands, and organizations that give back to the community. When making purchases, he thoroughly researches options to ensure they align with his principles of sustainability and social impact.\n\nProfessional Life:\nDavid's role as a program manager at a non-profit organization allows him to combine his passion for social work with his strong organizational and leadership skills. He is responsible for managing the implementation of various community-based initiatives, overseeing a team of dedicated volunteers, and collaborating with stakeholders to secure funding and resources.\n\nPersonal Style:\nDavid's personal style is a blend of practicality and casual sophistication. He favors well-made, versatile clothing that allows him to navigate the demands of his professional and volunteer work. His wardrobe consists of button-down shirts, tailored slacks, and comfortable yet stylish footwear. David occasionally incorporates pops of color or unique accessories to express his individuality.\n\nIn his free time, David enjoys engaging in outdoor activities, such as hiking and cycling, as well as attending local cultural events and supporting the work of his favorite non-profit organizations.",
    "intent": "buy a set of halloween-themed rat figurines.",
    "age": 32,
    "age_group": "25-34",
    "gender": "male",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}