{
    "persona": "Persona: Evan\n\nBackground:\nEvan is a versatile and passionate individual who has found success in the world of entrepreneurship. After several years of working in the corporate realm, he took the bold step of starting his own small business, leveraging his expertise in digital marketing and his keen eye for innovation.\n\nDemographics:\nAge: 36\nGender: Male\nEducation: Bachelor's Degree in Marketing\nProfession: Small Business Owner\nIncome: $55,000\n\nFinancial Situation:\nEvan's income as a small business owner falls within the $30,001 to $94,000 range, providing him with a level of financial stability. He carefully manages his finances, balancing the needs of his business with his personal expenses. Evan is disciplined in his budgeting and saving, ensuring he can weather any unexpected challenges that may arise.\n\nShopping Habits:\nEvan's shopping habits reflect his entrepreneurial mindset and his desire to invest in tools and resources that will help his business grow. He is selective in his purchases, thoroughly researching products and services to find the best value. While he is not one to splurge, Evan is willing to make strategic investments in high-quality items that will serve him well in both his professional and personal life.\n\nProfessional Life:\nAs the owner of a successful digital marketing agency, Evan is constantly seeking new ways to innovate and stay ahead of industry trends. He takes pride in his ability to deliver tailored solutions that help his clients achieve their business goals. Evan is a skilled communicator and networker, often collaborating with other entrepreneurs and industry experts to expand his knowledge and explore new opportunities.\n\nPersonal Style:\nEvan's personal style is a reflection of his dynamic lifestyle and his desire to present a professional yet approachable image. He favors well-fitted, versatile clothing that can seamlessly transition from the office to social events. His wardrobe includes a mix of classic staples, such as tailored dress shirts and slacks, as well as more casual, yet polished, pieces like modern blazers and slim-fit jeans. Evan accessorizes with subtle, high-quality items that add a touch of sophistication to his overall look.",
    "intent": "buy small dried shrimp for cooking",
    "age": 36,
    "age_group": "35-44",
    "gender": "male",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}