{
    "persona": "Persona: Lila\n\nBackground:\nLila is a passionate small-business owner who has poured her heart and soul into building a sustainable local café. After years of working in the corporate world, she took a leap of faith to pursue her dream of creating a welcoming community hub that prioritizes ethical and environmentally-conscious practices.\n\nDemographics:\nAge: 35\nGender: Female\nEducation: Associate's Degree\nProfession: Small-Business Owner (Café)\nIncome: $28,000\n\nFinancial Situation:\nAs a small-business owner, Lila's financial situation is somewhat precarious. She has invested a significant amount of her savings into launching and maintaining her café, and her income can fluctuate depending on the season and local economic conditions. However, Lila is driven by a sense of purpose rather than the pursuit of wealth, and she is committed to ensuring her business remains sustainable and true to her values.\n\nShopping Habits:\nLila is a mindful shopper who prioritizes local, ethical, and eco-friendly products for both her business and personal life. She frequents farmers' markets, small artisanal shops, and online ethical marketplaces to source high-quality ingredients and supplies for her café. When it comes to her personal wardrobe, Lila gravitates towards sustainable fashion brands and thrift store finds that align with her aesthetic and values.\n\nProfessional Life:\nRunning her own café is a constant source of fulfillment and challenge for Lila. She takes pride in crafting a warm and welcoming environment for her customers, fostering a sense of community through events and partnerships with local organizations. Lila is deeply invested in the success of her business and is always exploring new ways to innovate and improve her offerings.\n\nPersonal Style:\nLila's personal style is a reflection of her laid-back, earthy sensibilities. She favors comfortable, versatile pieces that allow her to move easily between her work and personal life. Her wardrobe consists of flowy dresses, cozy sweaters, and sturdy, practical shoes. Lila also incorporates handmade accessories and vintage pieces that add a unique touch to her overall look.\n\nIn her free time, Lila enjoys tending to her small urban garden, experimenting with new recipe ideas, and exploring the vibrant local arts and music scene. She finds joy in simple pleasures and values her connections with her community.",
    "intent": "add a mug of root beer to my cart for same-day delivery",
    "age": 35,
    "age_group": "35-44",
    "gender": "female",
    "income": [
        0,
        30000
    ],
    "income_group": "0-30000"
}