{
    "persona": "Persona: Ava\n\nBackground:\nAva is a rising star in the tech industry, having founded a successful software startup at the age of 22. Her innovative approach to problem-solving and her keen business acumen have propelled her company to the forefront of the competitive tech landscape.\n\nDemographics:\nAge: 20\nGender: Female\nEducation: Bachelor's Degree in Computer Science\nProfession: Founder and CEO of a Tech Startup\nIncome: $450,000\n\nFinancial Situation:\nAva's entrepreneurial endeavors have been immensely lucrative, allowing her to amass a sizable personal fortune at a young age. She has been diligent in her financial planning, investing a significant portion of her earnings into diverse asset classes to ensure long-term financial stability and growth.\n\nShopping Habits:\nAva's shopping habits reflect her success and her appreciation for quality craftsmanship. She is selective in her purchases, favoring high-end designer clothing, luxury automobiles, and cutting-edge tech gadgets that align with her personal style and professional image. However, Ava is also mindful of her spending and makes informed decisions to ensure she is obtaining the best value for her money.\n\nProfessional Life:\nAs the founder and CEO of a thriving tech startup, Ava is a driven and ambitious leader who has established a reputation for her strategic vision and her ability to navigate the complexities of the industry. She is a hands-on executive, actively involved in all aspects of the business, from product development to client relations. Ava is also a sought-after speaker and mentor, sharing her experiences and insights with the next generation of entrepreneurs.\n\nPersonal Style:\nAva's personal style is a reflection of her success and her position within the tech industry. She favors sleek, tailored silhouettes in muted tones, accented by bold, contemporary accessories that showcase her unique sense of fashion. Ava's wardrobe is a harmonious blend of professional attire and casual chic, allowing her to seamlessly transition between her role as a CEO and her role as a young, tech-savvy innovator.\n\nIn her free time, Ava enjoys exploring the latest advancements in technology, attending exclusive industry events, and networking with fellow entrepreneurs. She is also an avid traveler, using her wealth to explore new destinations and immerse herself in diverse cultures, which she believes further fuels her creativity and her drive for success.",
    "intent": "buy transparent plastic bags for formula one racing hygiene kits.",
    "age": 20,
    "age_group": "18-24",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}