{
    "persona": "Persona: Mia\n\nBackground:\nMia is a passionate, ambitious young professional who has quickly established herself as a rising star in the field of social media marketing. With a keen eye for digital trends and a natural talent for crafting engaging content, she has helped numerous businesses and influencers amplify their online presence and build strong, loyal followings.\n\nDemographics:\nAge: 22\nGender: Female\nEducation: Bachelor's Degree in Communications\nProfession: Social Media Marketing Specialist\nIncome: $52,000\n\nFinancial Situation:\nAs a young professional, Mia has a comfortable yet manageable financial situation. While she is not yet at the level of financial stability as some of her more experienced peers, her steady income as a social media marketing specialist allows her to cover her essential expenses, save for the future, and occasionally indulge in experiences and purchases that align with her personal values and interests.\n\nShopping Habits:\nMia's shopping habits reflect her youthful, trend-conscious mindset. She enjoys browsing online and in-person stores, seeking out the latest fashion, tech, and lifestyle products that resonate with her personal aesthetic and social media-savvy persona. However, Mia is also mindful of her spending, often opting for more affordable, yet stylish options that allow her to maintain a curated, visually-appealing wardrobe and lifestyle.\n\nPersonal Life:\nOutside of her thriving professional life, Mia prioritizes cultivating a well-rounded lifestyle. She is an avid fitness enthusiast, regularly attending yoga classes and high-intensity workouts to maintain her physical and mental well-being. Additionally, Mia is an active member of her local community, volunteering with a non-profit organization that provides digital skills training to underprivileged youth.\n\nPersonal Style:\nMia's personal style is a reflection of her youthful, dynamic personality. She gravitates towards trendy, yet versatile pieces that effortlessly transition from the office to social gatherings. Her wardrobe is a mix of contemporary, sustainable fashion brands and affordable, high-street finds that she artfully combines to create visually striking, Instagram-worthy outfits.",
    "intent": "buy a Cinnamoroll-themed desk organizer.",
    "age": 22,
    "age_group": "18-24",
    "gender": "female",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}