{
    "persona": "Persona: Cody\n\nBackground:\nCody is an ambitious and forward-thinking young professional who has quickly risen through the ranks in the world of finance. With a sharp analytical mind and a keen eye for emerging market trends, he has become a respected and sought-after investment advisor.\n\nDemographics:\nAge: 23\nGender: Male\nEducation: Master's Degree in Finance\nProfession: Investment Advisor\nIncome: $125,000\n\nFinancial Situation:\nCody's income as an investment advisor places him in a comfortable and secure financial position. He has a well-diversified investment portfolio, actively managing his assets to ensure steady growth and long-term financial stability. While he maintains a high standard of living, Cody is also mindful of his spending and prioritizes strategic investments and savings over extravagant purchases.\n\nShopping Habits:\nCody's shopping habits reflect his discerning and practical nature. He invests in high-quality, durable products that demonstrate a strong attention to design and functionality, whether it's the latest technological advancements or well-crafted business attire. Cody values brands that are known for their innovation, reliability, and attention to detail, and he is willing to pay a premium for products that meet his exacting standards.\n\nProfessional Life:\nCody's exceptional analytical skills and strategic thinking have made him a rising star in the investment advisory field. He is sought after by clients for his ability to navigate complex financial landscapes and identify lucrative investment opportunities. Cody is constantly staying ahead of industry trends, attending conferences and networking events to expand his knowledge and stay at the forefront of the industry.\n\nPersonal Life:\nOutside of his demanding professional responsibilities, Cody maintains a balanced lifestyle. He enjoys staying physically active, engaging in activities like rock climbing and cycling to stay fit and clear his mind. Cody also has a deep appreciation for art, often visiting local galleries and museums to explore new artistic expressions. He values intellectually stimulating conversations and actively seeks out opportunities to learn from his peers and industry experts.\n\nPersonal Style:\nCody's personal style is a reflection of his sophisticated and polished professional persona. His wardrobe features a mix of well-tailored suits, crisp dress shirts, and sleek, modern accessories that convey a sense of authority and attention to detail. Cody's fashion choices are a blend of timeless elegance and contemporary, trend-conscious elements, allowing him to maintain a refined and confident appearance in both formal and casual settings.",
    "intent": "add Pepsi Real Sugar to cart",
    "age": 23,
    "age_group": "18-24",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}