{
    "persona": "Persona: Emma\n\nBackground:\nEmma is a driven and ambitious young woman who has quickly established herself as a rising star in the world of finance. With a keen analytical mind and a passion for investing, she has already made a name for herself in the highly competitive investment banking industry.\n\nDemographics:\nAge: 19\nGender: Female\nEducation: Bachelor's Degree in Finance\nProfession: Investment Banker\nIncome: $117,000\n\nFinancial Situation:\nEmma's impressive income for her young age allows her to enjoy a comfortable and luxurious lifestyle. She is financially savvy, carefully managing her investments and savings to ensure long-term financial stability. While she enjoys the occasional high-end purchase, such as designer handbags or exotic vacations, Emma is primarily focused on building wealth and achieving her long-term financial goals.\n\nShopping Habits:\nAs a young professional in the finance industry, Emma has developed a sophisticated taste in fashion and luxury goods. She takes pride in her appearance and carefully curates her wardrobe, investing in well-made, timeless pieces from top designers. She also enjoys browsing the latest trends and experimenting with new styles, often seeking inspiration from fashion influencers and high-end retail stores.\n\nProfessional Life:\nEmma's expertise in financial analysis and her strong problem-solving skills have propelled her to the forefront of her field. As an investment banker, she works closely with clients to develop tailored investment strategies, leveraging her deep understanding of market trends and economic conditions. Emma is known for her ability to navigate complex financial landscapes and deliver exceptional results for her clients.\n\nPersonal Style:\nEmma's personal style reflects her professional success and her confidence in her own abilities. She favors sleek, tailored silhouettes and luxurious fabrics, often incorporating designer pieces into her wardrobe. Her style is both sophisticated and modern, with a touch of edge that sets her apart from her peers. Whether she's attending a high-profile industry event or simply running errands, Emma always looks polished and put-together.",
    "intent": "buy a SATA \"USB 3.2\" enclosure",
    "age": 19,
    "age_group": "18-24",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}