{
    "persona": "Persona: Michael\n\nBackground:\nMichael is a passionate outdoor enthusiast who has found a way to turn his love for nature into a fulfilling career. As an adventure travel guide, he leads groups on immersive excursions through breathtaking landscapes, sharing his deep knowledge and appreciation for the great outdoors.\n\nDemographics:\nAge: 42\nGender: Male\nEducation: Bachelor's degree in Environmental Science\nProfession: Adventure Travel Guide\nIncome: $48,000\n\nFinancial Situation:\nWith a steady income from his guiding work, Michael is able to maintain a comfortable lifestyle that allows him to indulge in his adventurous hobbies. He is financially responsible, setting aside funds for equipment upgrades, continuing education, and occasional travel for personal exploration.\n\nShopping Habits:\nMichael is selective in his shopping, prioritizing high-quality, durable gear and apparel that can withstand the rigors of his outdoor activities. He enjoys browsing specialty outdoor retailers and online forums to discover the latest innovations in camping, hiking, and adventure equipment. When it comes to personal items, he prefers minimalist and functional designs.\n\nProfessional Life:\nAs an adventure travel guide, Michael's days are filled with a diverse range of activities, from leading group hikes and kayaking excursions to planning itineraries and coordinating logistics. He thrives on the opportunity to share his passion for nature with others and to continually expand his own knowledge and skills in the field.\n\nPersonal Style:\nMichael's personal style is a reflection of his active, outdoor-oriented lifestyle. He favors comfortable, rugged clothing that can withstand the elements, such as moisture-wicking base layers, durable hiking pants, and sturdy boots. He also incorporates versatile, multi-purpose items that can seamlessly transition from the wilderness to the city.\n\nMichael typically wakes up early, around 6 am, to prepare for the day's activities. He resides in a cozy, energy-efficient cabin nestled in the mountains, just a short drive from some of the region's most breathtaking natural landscapes.",
    "intent": "buy celtic salt",
    "age": 42,
    "age_group": "35-44",
    "gender": "male",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}