{
    "persona": "Persona: Erica\n\nBackground:\nErica is a creative visionary who has made a name for herself in the world of fashion design. With a keen eye for style and a passion for innovative design, she founded her own luxury clothing line a decade ago, which has since gained a strong following among fashion-savvy consumers.\n\nDemographics:\nAge: 37\nGender: Female\nEducation: Bachelor's Degree in Fashion Design\nProfession: Founder and Creative Director of a Luxury Fashion Brand\nIncome: $175,000\n\nFinancial Situation:\nErica's successful fashion brand has provided her with a comfortable and stable income, allowing her to invest in both her business and personal life. She is financially savvy, carefully managing her assets and exploring various investment opportunities to secure her long-term financial future.\n\nShopping Habits:\nAs a fashion designer, Erica is constantly attuned to the latest trends and new developments in the industry. She enjoys visiting fashion shows, boutiques, and high-end retailers to stay inspired and discover unique, cutting-edge pieces. While she indulges in luxury purchases, Erica also values quality craftsmanship and ethical production, often seeking out sustainable and locally-sourced fashion items.\n\nProfessional Life:\nErica's role as the Founder and Creative Director of her luxury fashion brand is a true passion project. She oversees the design process, collaborates with her team of talented designers and production specialists, and ensures that each collection reflects her unique creative vision. Erica is known for her bold, innovative designs and her ability to anticipate and meet the evolving needs of her discerning clientele.\n\nPersonal Style:\nErica's personal style is a reflection of her design aesthetic – elegant, sophisticated, and modern. She embraces avant-garde silhouettes, rich fabrics, and striking color palettes, often incorporating her own designs into her daily wardrobe. Erica's accessory choices are equally intentional, from her signature statement jewelry pieces to her carefully curated collection of designer handbags and shoes.",
    "intent": "buy a Rubik's Cube case.",
    "age": 37,
    "age_group": "35-44",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}