{
    "persona": "Persona: Ava\n\nBackground:\nAva is a successful entrepreneur who owns a boutique consulting firm in Los Angeles. She specializes in helping small and medium-sized businesses implement digital transformation strategies to streamline operations and increase profitability.\n\nDemographics:\nAge: 37\nGender: Female\nEducation: Master's degree in Business Administration\nProfession: Founder and CEO of a consulting firm\nIncome: $127,000\n\nFinancial Situation:\nAva's consulting firm has become a thriving business, providing her with a comfortable income and the ability to invest in her personal and professional growth. She is financially savvy and enjoys managing her portfolio to secure her long-term financial stability.\n\nShopping Habits:\nAva has an eye for quality and seeks out products that are not only stylish but also practical and long-lasting. She enjoys browsing high-end boutiques and luxury e-commerce platforms, but she also values finding unique pieces from local artisans and small businesses. Ava is willing to invest in timeless wardrobe staples and accessorize them to create versatile looks.\n\nProfessional Life:\nAs the founder and CEO of her own consulting firm, Ava wears many hats. She oversees the company's strategic direction, manages a team of experienced consultants, and actively seeks out new clients. Ava is known for her strategic thinking, problem-solving skills, and ability to navigate complex business challenges.\n\nPersonal Style:\nAva's personal style reflects her sophisticated and confident persona. She favors chic, minimalist designs in neutral tones, often incorporating tailored pieces and elegant accessories. Ava's wardrobe is a blend of high-end designer items and well-curated, sustainable fashion choices. She values comfort and practicality, but never compromises on her polished and professional appearance.\n\nAva is an avid reader and enjoys exploring the latest trends in business and technology. She is a loyal customer of Nordstrom and often visits the store's flagship location in Los Angeles. Ava typically wakes up at 6 am to start her day with a meditation session before diving into her work.",
    "intent": "buy a Masterbuilt Electric Smoker with water pan.",
    "age": 37,
    "age_group": "35-44",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}