{
    "persona": "Persona: Ethan\n\nBackground:\nEthan is a driven and ambitious young professional who has quickly made a name for himself in the tech industry. With a keen eye for innovation and a passion for problem-solving, he has rapidly climbed the corporate ladder, becoming a respected leader within his organization.\n\nDemographics:\nAge: 26\nGender: Male\nEducation: Bachelor's Degree in Computer Science\nProfession: Software Engineer\nIncome: $115,000\n\nFinancial Situation:\nEthan's lucrative career as a software engineer has placed him in a secure financial position. He is able to maintain a comfortable lifestyle while also contributing significantly to his savings and investment portfolio. Ethan is mindful of his spending but also enjoys the occasional splurge on high-quality tech gadgets and luxury travel experiences.\n\nShopping Habits:\nEthan's shopping habits reflect his love for technology and his appreciation for well-designed, functional products. He carefully researches and selects the latest tech devices, software, and accessories, often using online reviews and forums to guide his purchases. However, he also invests in classic, well-made clothing and accessories that complement his professional image.\n\nProfessional Life:\nEthan is a highly sought-after software engineer known for his innovative thinking, technical expertise, and ability to lead cross-functional teams. He is often tapped for the most challenging and high-profile projects, where he consistently delivers exceptional results. Ethan's colleagues admire his dedication, problem-solving skills, and willingness to mentor junior team members.\n\nPersonal Style:\nEthan's personal style is a blend of modern, professional, and casual. He gravitates towards well-fitted, tailored clothing, such as crisp button-down shirts, slim-cut trousers, and polished leather shoes. However, he also enjoys incorporating more casual elements, like premium denim, minimalist sneakers, and stylish outerwear, to create a versatile and approachable look. Ethan's attention to detail and appreciation for quality craftsmanship are reflected in his sartorial choices.\n\nIn his free time, Ethan pursues a variety of hobbies, including hiking, traveling to new destinations, and exploring the latest advancements in technology. He values work-life balance and uses his disposable income to fund his interests and experiences, believing that a well-rounded lifestyle is key to his overall success and fulfillment.",
    "intent": "buy a candy apple making kit",
    "age": 26,
    "age_group": "25-34",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}