{
    "persona": "Persona: Garrett\n\nBackground:\nGarrett is a driven and ambitious young professional who is carving out his path in the dynamic world of marketing. With a keen eye for trends and a strategic mindset, he has quickly risen through the ranks, becoming a valuable asset to the agency he works for.\n\nDemographics:\nAge: 20\nGender: Male\nEducation: Bachelor's Degree in Marketing\nProfession: Marketing Specialist\nIncome: $50,000\n\nFinancial Situation:\nGarrett's income as a marketing specialist places him in the $30,001 to $94,000 range, reflecting his growing expertise and responsibilities within the agency. He is diligent in managing his finances, setting aside funds for both short-term goals and long-term investments.\n\nShopping Habits:\nGarrett's shopping habits are a blend of practicality and aspiration. While he is mindful of his budget, he enjoys seeking out quality products that enhance his personal and professional life. He is an avid online shopper, taking advantage of targeted sales and discounts to curate a wardrobe and tech setup that aligns with his stylish and tech-savvy persona.\n\nPersonal Style:\nGarrett's personal style is a reflection of his evolving professional identity. He gravitates towards a mixture of contemporary and classic pieces, pairing well-fitted chinos with crisp button-down shirts and sleek, minimalist sneakers. Garrett also takes pride in his collection of stylish, high-performance accessories, such as a smartwatch and a slim, lightweight laptop bag.\n\nProfessional Life:\nAs a marketing specialist, Garrett is responsible for developing and executing innovative campaigns that drive brand awareness and engagement. He is adept at analyzing market trends, crafting compelling content, and leveraging the latest digital tools to optimize the agency's client strategies. Garrett's ability to think outside the box and his proactive approach to problem-solving have made him a valuable asset to the agency.\n\nPersonal Life:\nIn his free time, Garrett enjoys staying active, whether it's through a challenging workout routine or exploring the city's vibrant cultural scene. He is an avid reader, with a particular interest in the latest business and marketing trends. Garrett also dedicates time to networking and professional development, attending industry events and workshops to expand his knowledge and build connections within the marketing community.",
    "intent": "buy edible glitter for drinks.",
    "age": 20,
    "age_group": "18-24",
    "gender": "male",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}