{
    "persona": "Persona: Emily\n\nBackground:\nEmily is a driven and ambitious young professional who has quickly risen through the ranks of the corporate world. With a sharp business acumen and a passion for innovation, she has established herself as a trailblazer in her industry.\n\nDemographics:\nAge: 29\nGender: Female\nEducation: Master's Degree in Business Administration\nProfession: Startup Founder\nIncome: $150,000\n\nFinancial Situation:\nAs the founder of a successful tech startup, Emily's income falls within the $94,001 to $1,000,000 range. She has been able to secure significant funding and investment for her company, allowing her to not only maintain a comfortable lifestyle but also reinvest in the growth and development of her business.\n\nShopping Habits:\nEmily's shopping habits reflect her savvy and strategic mindset. She is selective in her purchases, prioritizing high-quality, versatile items that can seamlessly transition between her professional and personal life. She often utilizes online shopping platforms and mobile apps to research and compare products, ensuring she makes informed decisions that align with her goals and values.\n\nProfessional Life:\nEmily's professional life is a testament to her entrepreneurial spirit and her ability to identify and capitalize on emerging market opportunities. As the founder of a rapidly growing tech startup, she is responsible for overseeing all aspects of the business, from product development and marketing to fundraising and team management. Her strong leadership skills and innovative thinking have been instrumental in the company's success.\n\nPersonal Style:\nEmily's personal style is a reflection of her confident and dynamic persona. She favors a modern, minimalist aesthetic, with a focus on timeless pieces that can be easily mixed and matched. Her wardrobe includes a blend of high-end designer items and carefully curated, versatile essentials that allow her to maintain a polished and professional appearance in both formal and casual settings.",
    "intent": "buy light up witch wands for adults.",
    "age": 29,
    "age_group": "25-34",
    "gender": "female",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}