{
    "persona": "Persona: Michael\n\nBackground:\nMichael is a seasoned industrial designer who has spent the last two decades honing his craft and creating innovative products that blend form and function. With a keen eye for aesthetics and a deep understanding of user needs, he has built a successful career as a sought-after consultant, helping a diverse range of clients bring their visions to life.\n\nDemographics:\nAge: 52\nGender: Male\nEducation: Bachelor's Degree in Industrial Design\nProfession: Independent Design Consultant\nIncome: $52,000\n\nFinancial Situation:\nAs an independent consultant, Michael's income fluctuates, but he has managed to maintain a comfortable financial standing over the years. He is diligent about managing his expenses, investing in his professional development, and setting aside funds for retirement. While he enjoys the flexibility and autonomy of his work, Michael also recognizes the importance of financial stability, which he has achieved through careful planning and disciplined saving.\n\nShopping Habits:\nMichael's shopping habits reflect his passion for design and his appreciation for quality craftsmanship. He is drawn to products that showcase innovative design, attention to detail, and a commitment to sustainability. When making purchases, Michael takes the time to research and evaluate his options, often seeking out small, independent brands and artisans whose work aligns with his values.\n\nPersonal Style:\nMichael's personal style is a harmonious blend of classic elegance and modern sensibilities. He favors well-tailored, minimalist pieces that showcase his refined aesthetic, such as crisp button-down shirts, slim-fit trousers, and sleek leather loafers. At the same time, Michael is not afraid to experiment with bolder, more expressive elements, like statement-making accessories or tailored jackets in unexpected colors or patterns.\n\nProfessional Life:\nAs an independent design consultant, Michael's professional life is a dynamic and ever-evolving landscape. He collaborates with a diverse range of clients, from tech startups to established manufacturing companies, to create products that solve real-world problems and delight users. Michael's design process is marked by a deep commitment to user research, iterative prototyping, and a relentless pursuit of innovation.",
    "intent": "buy a set of mini playdough for personal creative projects.",
    "age": 52,
    "age_group": "45-54",
    "gender": "male",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}