{
    "persona": "Persona: Michael\n\nBackground:\nMichael is a dynamic and versatile professional who has carved out a successful career as a software engineer. With a strong foundation in computer science and a passion for problem-solving, he has become a highly sought-after member of the engineering team at a thriving technology startup.\n\nDemographics:\nAge: 30\nGender: Male\nEducation: Bachelor's Degree in Computer Science\nProfession: Software Engineer\nIncome: $75,000\n\nFinancial Situation:\nAs a mid-career software engineer, Michael's income falls within the upper range of the provided criteria, allowing him to maintain a comfortable standard of living and save for both short-term and long-term financial goals. He is fiscally responsible, carefully budgeting his expenses and exploring strategic investment opportunities to grow his wealth.\n\nShopping Habits:\nMichael's shopping habits reflect his pragmatic and efficiency-driven mindset. He seeks out high-quality, functional products that will enhance his productivity and streamline his daily routines. While he is not averse to splurging on occasional tech gadgets or outdoor gear that aligns with his hobbies, Michael generally prioritizes value and practicality over flashy trends.\n\nProfessional Life:\nAs a software engineer, Michael utilizes his analytical skills and technical expertise to develop innovative solutions that drive the success of his company. He is known for his ability to think critically, identify pain points, and implement effective, user-friendly software applications. Michael's collaborative nature and strong problem-solving skills have earned him the respect of his colleagues and the trust of his clients.\n\nPersonal Style:\nMichael's personal style strikes a balance between casual comfort and a polished, professional appearance. On a typical workday, you might find him wearing a well-fitted button-down shirt, dark-wash jeans, and a pair of sleek leather loafers. When not in the office, Michael gravitates towards athleisure wear and sporty ensembles that reflect his active lifestyle and passion for outdoor adventures.\n\nLeisure Activities:\nIn his free time, Michael indulges in a variety of hobbies that allow him to recharge and maintain a healthy work-life balance. He is an avid hiker and mountain biker, frequently exploring the local trails and finding solace in the great outdoors. Additionally, Michael is a self-proclaimed tech enthusiast, staying up-to-date with the latest innovations and often tinkering with new gadgets and software applications.",
    "intent": "buy a set of camilia red beans miniatures.",
    "age": 30,
    "age_group": "25-34",
    "gender": "male",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}