{
    "persona": "Persona: Andrew\n\nBackground:\nAndrew is a visionary entrepreneur who has built a thriving technology startup from the ground up. With a keen eye for emerging trends and a knack for innovative problem-solving, he has positioned his company as a leader in its industry.\n\nDemographics:\nAge: 38\nGender: Male\nEducation: Master's Degree in Computer Science\nProfession: Founder and CEO of a Technology Startup\nIncome: $275,000\n\nFinancial Situation:\nAndrew's entrepreneurial success has afforded him a comfortable, yet fiscally responsible, lifestyle. He carefully manages his finances, investing a significant portion of his income to ensure the long-term growth and stability of his business and personal wealth.\n\nShopping Habits:\nWhile Andrew appreciates quality and craftsmanship, he tends to be pragmatic in his shopping habits. He is selective about his purchases, often researching products thoroughly to ensure they meet his needs and expectations. He is willing to invest in high-quality items that will stand the test of time, but also seeks out innovative, technology-driven solutions that streamline his daily routine.\n\nProfessional Life:\nAs the founder and CEO of his startup, Andrew is a tireless visionary who is constantly driving his company forward. He leads a talented team of engineers and developers, fostering a dynamic and collaborative work environment. Andrew is also an active participant in the local tech community, mentoring aspiring entrepreneurs and speaking at industry events.\n\nPersonal Style:\nAndrew's personal style reflects his busy, technology-driven lifestyle. He favors sleek, modern attire that is both comfortable and professional, often pairing well-fitted dress shirts and trousers with minimalist, state-of-the-art accessories. He values functionality and timelessness in his wardrobe choices.",
    "intent": "buy a non-rust hook removal tool for fishing box.",
    "age": 38,
    "age_group": "35-44",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}