{
    "persona": "Persona: Susan\n\nBackground:\nSusan is a retired social worker who has dedicated her life to advocating for the rights of marginalized individuals in her community. With a deep well of empathy and a wealth of experience, she continues to be a driving force for positive change, even in her golden years.\n\nDemographics:\nAge: 62\nGender: Female\nEducation: Bachelor's Degree in Social Work\nProfession: Retired Social Worker\nIncome: $48,000\n\nFinancial Situation:\nAs a retired social worker, Susan's income falls within the $30,001 to $94,000 range. While she may not be considered wealthy, she has managed her finances prudently, allowing her to maintain a comfortable lifestyle and continue supporting the causes she is passionate about.\n\nShopping Habits:\nSusan's shopping habits reflect her practical and conscientious nature. She values quality over quantity, often investing in durable, long-lasting items that align with her environmental and ethical concerns. When making purchases, she carefully considers the necessity and impact of her choices, prioritizing products from socially responsible companies.\n\nProfessional Life:\nThroughout her career, Susan has been a tireless advocate for the rights of the underprivileged and marginalized members of her community. She has worked tirelessly to connect individuals with the resources and support they need, often going above and beyond to ensure their well-being. Even in retirement, Susan continues to volunteer and serve on the board of several local non-profit organizations, applying her expertise and passion to drive positive change.\n\nPersonal Style:\nSusan's personal style is practical and comfortable, with a focus on timeless pieces that convey a sense of warmth and authenticity. She favors natural fibers, earth-toned palettes, and well-tailored silhouettes that allow her to move freely and express her refined yet approachable sensibilities. Her style reflects her commitment to sustainability and her desire to set an example of graceful aging.\n\nIn her free time, Susan enjoys pursuing her lifelong love of gardening, volunteering at a local community center, and engaging in lively discussions with her book club. She takes great pride in her role as a mentor and role model for younger generations, sharing her wisdom and insights to inspire positive change.",
    "intent": "add to cart 3 assorted non-alcoholic mocktail recipes",
    "age": 62,
    "age_group": "55-64",
    "gender": "female",
    "income": [
        30001,
        94000
    ],
    "income_group": "30001-94000"
}