{
    "persona": "Persona: Ethan\n\nBackground:\nEthan is a rising entrepreneur in the tech industry, having founded a successful startup that specializes in developing innovative software solutions. With a keen eye for emerging trends and an unwavering commitment to problem-solving, he has quickly made a name for himself in the competitive world of technology.\n\nDemographics:\nAge: 20\nGender: Male\nEducation: Bachelor's Degree in Computer Science\nProfession: Founder and CEO of a Tech Startup\nIncome: $110,000\n\nFinancial Situation:\nEthan's entrepreneurial venture has provided him with a sizable income, allowing him to enjoy a comfortable lifestyle and invest in his future. He is financially savvy, carefully managing his earnings to ensure the long-term stability and growth of his company, while also setting aside funds for personal investments and future opportunities.\n\nShopping Habits:\nEthan's shopping habits reflect his innovative mindset and his appreciation for high-quality, technologically-advanced products. He is an early adopter of the latest gadgets and software, often researching and testing new technologies to stay ahead of the curve. When it comes to his personal style, Ethan favors a minimalist, modern aesthetic, investing in well-designed clothing and accessories that complement his fast-paced, technology-driven lifestyle.\n\nProfessional Life:\nAs the founder and CEO of his tech startup, Ethan is the driving force behind the company's vision and growth. He leads a talented team of developers, designers, and business strategists, fostering an environment of collaboration and innovation. Ethan's technical expertise, coupled with his entrepreneurial spirit and keen business acumen, have been instrumental in securing funding, attracting top talent, and positioning his company as a trailblazer in the industry.\n\nPersonal Style:\nEthan's personal style is a reflection of his professional persona – sleek, sophisticated, and always ahead of the curve. He favors slim-cut suits, crisp button-down shirts, and minimalist accessories, often incorporating the latest trends in men's fashion. Ethan's wardrobe is a harmonious blend of function and style, enabling him to transition seamlessly between business meetings, industry events, and casual social gatherings.\n\nIn his free time, Ethan indulges in his passion for technology, attending tech conferences and hackathons to stay informed about the latest innovations. He is also an avid reader, with a particular interest in business strategy, entrepreneurship, and cutting-edge research in the field of computer science. Ethan's diverse interests and his drive to constantly learn and grow contribute to his well-rounded and dynamic persona.",
    "intent": "add to cart pokemon sword and shield booster box set 3",
    "age": 20,
    "age_group": "18-24",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}