{
    "persona": "Persona: Michael\n\nBackground:\nMichael is a dedicated community organizer who has spent the past two decades advocating for the rights and well-being of marginalized populations in his city. Despite facing numerous challenges and limited resources, he continues to tirelessly work to create positive change and improve the lives of those in need.\n\nDemographics:\nAge: 52\nGender: Male\nEducation: High School Diploma\nProfession: Community Organizer\nIncome: $22,000\n\nFinancial Situation:\nAs a community organizer, Michael's income falls within the $0 to $30,000 range. He lives a modest lifestyle, carefully budgeting his resources to ensure he can continue his vital work. While he struggles to make ends meet at times, Michael finds fulfillment in the impact he has on the lives of the individuals and communities he serves.\n\nShopping Habits:\nMichael's shopping habits are primarily driven by necessity and functionality. He shops for durable, practical clothing and household items that can withstand the demands of his work. Whenever possible, he takes advantage of thrift stores, secondhand markets, and community resources to stretch his limited budget. Michael values quality over quantity and seeks out products that will serve him well in the long run.\n\nProfessional Life:\nMichael's professional life is centered around his role as a community organizer. He works tirelessly to advocate for the rights and needs of marginalized groups, navigating complex systems and bureaucracies to secure resources and support for those he serves. Michael's unwavering dedication, empathy, and problem-solving skills make him a respected and influential figure in his community.\n\nPersonal Style:\nMichael's personal style reflects his practical and hardworking nature. He tends to favor comfortable, durable clothing that allows him to move freely and focus on his work. His wardrobe consists of sturdy jeans, well-worn button-down shirts, and reliable work boots. While he may not follow the latest fashion trends, Michael takes pride in his appearance and aims to present a professional, approachable image.\n\nIn his limited free time, Michael enjoys engaging in community-based activities, such as volunteering at local shelters or organizing neighborhood clean-up events. He finds solace in the camaraderie and sense of purpose these endeavors provide, fueling his continued passion for his important work.",
    "intent": "add to cart a navy blue bodycon romper in size medium.",
    "age": 52,
    "age_group": "45-54",
    "gender": "male",
    "income": [
        0,
        30000
    ],
    "income_group": "0-30000"
}