{
    "persona": "Persona: David\n\nBackground:\nDavid is a seasoned marketing executive with over two decades of experience in the industry. He has a proven track record of spearheading successful campaigns for prestigious brands, making him a highly sought-after consultant and thought leader in the field.\n\nDemographics:\nAge: 46\nGender: Male\nEducation: Master's Degree in Marketing\nProfession: Marketing Consultant\nIncome: $125,000\n\nFinancial Situation:\nDavid's extensive experience and expertise have earned him a comfortable, six-figure income. He has meticulously managed his finances over the years, allowing him to invest in a diverse portfolio of assets, including real estate and high-growth stocks. While he enjoys the finer things in life, David is also mindful of his spending and maintains a balanced approach to his financial well-being.\n\nShopping Habits:\nAs a discerning consumer, David has a sophisticated taste in products and services. He frequents luxury retailers and boutiques, seeking out high-quality, timeless pieces that complement his refined aesthetic. Whether it's a tailored suit, a high-end timepiece, or the latest technological gadget, David is willing to invest in items that reflect his personal style and professional status.\n\nProfessional Life:\nDavid's extensive expertise and industry connections have made him a sought-after marketing consultant. He works with a diverse range of clients, from established corporations to innovative startups, providing strategic guidance and innovative solutions to help them achieve their marketing objectives. David's ability to think creatively and adapt to changing market conditions has earned him a reputation as a trusted advisor and invaluable asset to his clients.\n\nPersonal Style:\nDavid's personal style is a reflection of his professional success and refined taste. He favors classic, well-tailored pieces, such as crisp dress shirts, tailored trousers, and high-quality leather accessories. However, he is not afraid to incorporate subtle trends and bold accents, demonstrating his understanding of contemporary fashion and his desire to stay ahead of the curve.\n\nIn his free time, David enjoys indulging in his passion for fine dining, art, and travel. He is an avid collector of rare wines and a frequent patron of high-end cultural events and exhibitions.",
    "intent": "buy an outdoor movie screen with stand.",
    "age": 46,
    "age_group": "45-54",
    "gender": "male",
    "income": [
        94001,
        1000000
    ],
    "income_group": "94001-1000000"
}