{
    "persona": "Persona: Ashley\n\nBackground:\nAshley is a passionate artist who has chosen to pursue her creative passions over a traditional corporate career. She has found fulfillment in the freedom and flexibility of being a freelance illustrator, working on a variety of projects for clients across different industries.\n\nDemographics:\nAge: 34\nGender: Female\nEducation: Bachelor's degree in Fine Arts\nProfession: Freelance Illustrator\nIncome: $25,000\n\nFinancial Situation:\nAs a freelance artist, Ashley's income can be unpredictable, but she has learned to manage her finances carefully. She lives modestly, prioritizing her creative work over material possessions. While she doesn't have a high income, Ashley is content with her lifestyle and focused on growing her freelance business.\n\nShopping Habits:\nAshley approaches shopping with a mindful and intentional mindset. She prefers to invest in high-quality, ethically-sourced materials and supplies for her art projects. When it comes to personal items, she is selective and gravitates toward unique, artisanal pieces that align with her creative aesthetic. Ashley enjoys thrifting and repurposing items, finding joy in the hunt for one-of-a-kind treasures.\n\nProfessional Life:\nAshley's days are filled with a diverse range of creative tasks, from conceptualizing new illustrations to collaborating with clients to bring their visions to life. She thrives in the flexibility of her freelance lifestyle, which allows her to manage her time and energy according to her artistic needs. Ashley is constantly seeking out new challenges and opportunities to expand her portfolio and skill set.\n\nPersonal Style:\nAshley's personal style is a reflection of her artistic sensibilities. She embraces a bohemian-inspired look, often incorporating vintage and eco-conscious pieces into her wardrobe. She values comfort and self-expression, favoring flowing fabrics, earthy tones, and unique accessories that add a touch of whimsy to her overall aesthetic.\n\nAshley prefers to commute by public transportation and typically wakes up at 9am each day. She resides in a cozy studio apartment in a vibrant, artsy neighborhood of a major city.",
    "intent": "buy a full leg compression sleeve for women.",
    "age": 34,
    "age_group": "25-34",
    "gender": "female",
    "income": [
        0,
        30000
    ],
    "income_group": "0-30000"
}