{
    "persona": "Persona: David\n\nBackground:\nDavid is a passionate freelance graphic designer who has carved out a niche for himself in the creative industry. With a keen eye for design and a talent for bringing his clients' visions to life, he has established a loyal following of small businesses and independent entrepreneurs.\n\nDemographics:\nAge: 36\nGender: Male\nEducation: Associate's Degree in Graphic Design\nProfession: Freelance Graphic Designer\nIncome: $25,000\n\nFinancial Situation:\nAs a freelance graphic designer, David's income can fluctuate depending on the number of projects he secures and the rates he is able to charge. Currently, his annual income falls within the $0 to $30,000 range, which requires him to carefully manage his finances and budget his expenses. Despite the occasional financial challenges, David remains committed to his craft and finds fulfillment in the work he does.\n\nShopping Habits:\nDavid's shopping habits reflect his creative mindset and passion for design. He tends to be selective in his purchases, often investing in high-quality art supplies, design software, and equipment that can enhance his productivity and creative output. At the same time, he is mindful of his budget and looks for opportunities to save on everyday expenses, such as by shopping at thrift stores or taking advantage of online sales.\n\nProfessional Life:\nDavid's professional life is a blend of client-based work and personal creative projects. He takes great pride in his ability to translate his clients' ideas into visually stunning designs, whether it's creating a brand identity, designing marketing materials, or developing a website. In his free time, David also indulges in personal design experiments, exploring new techniques and pushing the boundaries of his creative abilities.\n\nPersonal Style:\nDavid's personal style is a reflection of his creative and laid-back personality. He favors a casual, yet stylish, approach to fashion, often pairing graphic tees, slim-fit jeans, and comfortable sneakers. He also enjoys accessorizing with items that showcase his design sensibility, such as statement jewelry or unique leather goods.\n\nIn his spare time, David can be found exploring the local art scene, attending design conferences, or immersing himself in the latest design trends and technologies. He is constantly seeking opportunities to learn, grow, and network with other creatives in the industry.",
    "intent": "buy a high-quality stainless steel cooling rack for baking.",
    "age": 36,
    "age_group": "35-44",
    "gender": "male",
    "income": [
        0,
        30000
    ],
    "income_group": "0-30000"
}